https://github.com/osin-vladimir/architect_big_data_solutions_with_spark/tree/master


https://github.com/TrainingByPackt/Big-Data-Processing-with-Apache-Spark/tree/master

https://sefidian.com/2023/01/11/machine-learning-for-big-data-using-pyspark-with-real-world-projects/


github reference

In [ ]:
import pyspark

In [ ]:
from pyspark.sql import SparkSession

In [ ]:
# create a spark session
spark = SparkSession.builder.appName("PySparkExample").getOrCreate()

# create a DataFrame with sample data
data = [("Alice",25),("Bob",30),("Charle",35)]
df = spark.createDataFrame(data,["Name","Age"])

In [ ]:
df.show()

+------+---+
|  Name|Age|
+------+---+
| Alice| 25|
|   Bob| 30|
|Charle| 35|
+------+---+

In [ ]:
spark.stop()

In [ ]:
from pyspark.sql import SparkSession

# initialize spark session
spark = SparkSession.builder.appName("EmployeeDataAnalysis").getOrCreate()

In [ ]:
df = spark.read.csv("test1.csv",header=True,inferSchema=True)

In [ ]:
df.printSchema()
df.show(5)

root
 |-- Name: string (nullable = true)
 |-- age: integer (nullable = true)
 |-- Experience: integer (nullable = true)
 |-- Salary: integer (nullable = true)

+---------+---+----------+------+
|     Name|age|Experience|Salary|
+---------+---+----------+------+
|    Krish| 31|        10| 30000|
|Sudhanshu| 30|         8| 25000|
|    Sunny| 29|         4| 20000|
|     Paul| 24|         3| 20000|
|   Harsha| 21|         1| 15000|
+---------+---+----------+------+
only showing top 5 rows

In [ ]:
df.createOrReplaceTempView("employees")

In [ ]:
spark.sql("SELECT * FROM employees WHERE Salary = 30000").show()

+-----+---+----------+------+
| Name|age|Experience|Salary|
+-----+---+----------+------+
|Krish| 31|        10| 30000|
+-----+---+----------+------+

#RDD

In [ ]:
# import spark session
from pyspark.sql import SparkSession

In [ ]:
# create spark session
spark = SparkSession.builder.master("local[1]").appName("sparkexample.com").getOrCreate()

In [ ]:
# create RDD from external data source
rdd2 = spark.sparkContext.textFile("test1.csv")

In [ ]:
spark.stop()

RDD - Resilient Distributed Dataset

2 tyoes of operations :- Transformations and Actions

Transformations - map,filter,flatMap,groupByKey,reduceByKey,join,union,sortByKey,distinct, sample,mapPartitions and aggregatedByKey.

These functions transform RDD by applying computations in a distributed mannaer across a cluster of machines and return a new RDD

Actions in  pySpark trigger computations and return result to the spark driver. key actions :- collect,count,take,reduce,foreach,first,takeOrdered,takeSample,countByKey,saveAsTextFile,saveAsSequenceFile,saveAsObjectFuile,ForeachPartiotion,collectAsMap,aggregate,fold. these actions initiate execution and materialize RDD data.

Any RDD operation that returns non RDD is considered as an actions

#DataFrame

In [ ]:
# create a spark session
spark = SparkSession.builder.appName("PySparkExample").getOrCreate()

# create a DataFrame with sample data
data = [("Alice",25),("Bob",30),("Charle",35)]
df = spark.createDataFrame(data,["Name","Age"])

In [ ]:
df.show()

+------+---+
|  Name|Age|
+------+---+
| Alice| 25|
|   Bob| 30|
|Charle| 35|
+------+---+

In [ ]:
df.printSchema()

root
 |-- Name: string (nullable = true)
 |-- Age: long (nullable = true)

In [ ]:
spark.stop()

DataFrame is a distributed dataset comprising data arranged in rows and columns with named attributes. It shares similarities with relational database tables or python dataframes but incorporates sophisticated optimizations.

Operations - Transformations and actions

In [ ]:
# Create DataFrame from CSV file
df = spark.read.csv("test1.csv")
df.printSchema()

root
 |-- _c0: string (nullable = true)
 |-- _c1: string (nullable = true)
 |-- _c2: string (nullable = true)
 |-- _c3: string (nullable = true)

#PySpark SQL
PySpark SQL is module in Spark that provides higher-level abstraction for working with structured data and can be used SQL queries.

SQL enables you to write SQL queries against structured data, leveraging standard SQL syntax and semantics. This familiarity with SQL allows users with SQL proficiency to transition to Spark for data processing tasks easily.

First, you should create a temporary table or view on DataFrame to use SQL queries. Once the table is created, you can be accessed throughout the SparkSession using sql().

These tables and views are scoped to the SparkSession that created them. Once the SparkSession is terminated, either by closing the Spark application or ending the Spark session explicitly, the temporary views are removed from memory.

To run SQL queries, use sql() method of the SparkSession object. Note that this function returns a DataFrame.

In [ ]:
# create temporary table
df.createOrReplaceTempView("PERSON_DATA")

# Run SQL query
df2 = spark.sql("SELECT * from PERSON_DATA")
df2.printSchema()
df2.show()

root
 |-- _c0: string (nullable = true)
 |-- _c1: string (nullable = true)
 |-- _c2: string (nullable = true)
 |-- _c3: string (nullable = true)

+---------+---+----------+------+
|      _c0|_c1|       _c2|   _c3|
+---------+---+----------+------+
|     Name|age|Experience|Salary|
|    Krish| 31|        10| 30000|
|Sudhanshu| 30|         8| 25000|
|    Sunny| 29|         4| 20000|
|     Paul| 24|         3| 20000|
|   Harsha| 21|         1| 15000|
|  Shubham| 23|         2| 18000|
+---------+---+----------+------+

Use groupby to run aggregate queries

In [ ]:
from pyspark.sql import SparkSession

spark = SparkSession.builder.appName("Practice with Spark").getOrCreate()
data = spark.read.csv("test3.csv",sep=',',inferSchema=True,header=True)

In [ ]:
data.show()

+---------+------------+------+
|     Name| Departments|salary|
+---------+------------+------+
|    Krish|Data Science| 10000|
|    Krish|         IOT|  5000|
|   Mahesh|    Big Data|  4000|
|    Krish|    Big Data|  4000|
|   Mahesh|Data Science|  3000|
|Sudhanshu|Data Science| 20000|
|Sudhanshu|         IOT| 10000|
|Sudhanshu|    Big Data|  5000|
|    Sunny|Data Science| 10000|
|    Sunny|    Big Data|  2000|
+---------+------------+------+

In [ ]:
data.printSchema()

root
 |-- Name: string (nullable = true)
 |-- Departments: string (nullable = true)
 |-- salary: integer (nullable = true)

In [ ]:
# create temp tabel

data.createOrReplaceTempView("EmployeeData")

In [ ]:
# Using groupby
groupDF = spark.sql("SELECT Departments,count(*) from EmployeeData group by Departments")
groupDF.show()

+------------+--------+
| Departments|count(1)|
+------------+--------+
|         IOT|       2|
|    Big Data|       4|
|Data Science|       4|
+------------+--------+

In [ ]:
# List all employees in the IT department.
	# •	Get the average salary department-wise.
	# •	Count the number of employees per location.

https://github.com/iamirmasoud/pyspark_tutorials/blob/master/2_IO_Filter_SQL/1_Read_Write_and_Validate_Data/1_Read_Write_and_Validate_Data%20-%20Students%20Performance.ipynb

In [ ]:
import pyspark
from pyspark.sql import SparkSession

spark = SparkSession.builder.appName("ReadWriteVal").getOrCreate()

In [ ]:
# reading data

In [ ]:
#import
import pyspark
from pyspark.sql import SparkSession

spark = SparkSession.builder.appName("Employee").getOrCreate()

In [ ]:
df = spark.read.csv("test1.csv",inferSchema=True,header=True)

In [ ]:
df.show()

+---------+---+----------+------+
|     Name|age|Experience|Salary|
+---------+---+----------+------+
|    Krish| 31|        10| 30000|
|Sudhanshu| 30|         8| 25000|
|    Sunny| 29|         4| 20000|
|     Paul| 24|         3| 20000|
|   Harsha| 21|         1| 15000|
|  Shubham| 23|         2| 18000|
+---------+---+----------+------+

In [ ]:
df.createOrReplaceTempView("Employees")

In [ ]:
spark.sql("Select * From Employees").show()

+---------+---+----------+------+
|     Name|age|Experience|Salary|
+---------+---+----------+------+
|    Krish| 31|        10| 30000|
|Sudhanshu| 30|         8| 25000|
|    Sunny| 29|         4| 20000|
|     Paul| 24|         3| 20000|
|   Harsha| 21|         1| 15000|
|  Shubham| 23|         2| 18000|
+---------+---+----------+------+

In [ ]:
spark.sql("Select * from Employees where age>21").show()

+---------+---+----------+------+
|     Name|age|Experience|Salary|
+---------+---+----------+------+
|    Krish| 31|        10| 30000|
|Sudhanshu| 30|         8| 25000|
|    Sunny| 29|         4| 20000|
|     Paul| 24|         3| 20000|
|  Shubham| 23|         2| 18000|
+---------+---+----------+------+

In [ ]:
df1 = spark.read.csv("test2.csv",header=True,inferSchema=True)

In [ ]:
df1.show()

+---------+----+----------+------+
|     Name| age|Experience|Salary|
+---------+----+----------+------+
|    Krish|  31|        10| 30000|
|Sudhanshu|  30|         8| 25000|
|    Sunny|  29|         4| 20000|
|     Paul|  24|         3| 20000|
|   Harsha|  21|         1| 15000|
|  Shubham|  23|         2| 18000|
|   Mahesh|NULL|      NULL| 40000|
|     NULL|  34|        10| 38000|
|     NULL|  36|      NULL|  NULL|
+---------+----+----------+------+

In [ ]:
df1 = df1.withColumn("Experience after 2 years",df1['Experience']+2)

In [ ]:
df1.show()

+---------+----+----------+------+------------------------+
|     Name| age|Experience|Salary|Experience after 2 years|
+---------+----+----------+------+------------------------+
|    Krish|  31|        10| 30000|                      12|
|Sudhanshu|  30|         8| 25000|                      10|
|    Sunny|  29|         4| 20000|                       6|
|     Paul|  24|         3| 20000|                       5|
|   Harsha|  21|         1| 15000|                       3|
|  Shubham|  23|         2| 18000|                       4|
|   Mahesh|NULL|      NULL| 40000|                    NULL|
|     NULL|  34|        10| 38000|                      12|
|     NULL|  36|      NULL|  NULL|                    NULL|
+---------+----+----------+------+------------------------+

In [ ]:
df1 = df1.drop("Experience after 2 years")

In [ ]:
df1.show()

+---------+----+----------+------+
|     Name| age|Experience|Salary|
+---------+----+----------+------+
|    Krish|  31|        10| 30000|
|Sudhanshu|  30|         8| 25000|
|    Sunny|  29|         4| 20000|
|     Paul|  24|         3| 20000|
|   Harsha|  21|         1| 15000|
|  Shubham|  23|         2| 18000|
|   Mahesh|NULL|      NULL| 40000|
|     NULL|  34|        10| 38000|
|     NULL|  36|      NULL|  NULL|
+---------+----+----------+------+

In [ ]:
df1 = df1.withColumnRenamed("Name","New Name")

In [ ]:
df1.show()

+---------+----+----------+------+
| New Name| age|Experience|Salary|
+---------+----+----------+------+
|    Krish|  31|        10| 30000|
|Sudhanshu|  30|         8| 25000|
|    Sunny|  29|         4| 20000|
|     Paul|  24|         3| 20000|
|   Harsha|  21|         1| 15000|
|  Shubham|  23|         2| 18000|
|   Mahesh|NULL|      NULL| 40000|
|     NULL|  34|        10| 38000|
|     NULL|  36|      NULL|  NULL|
+---------+----+----------+------+

In [ ]:
df1 = df1.na.drop(how="all")

In [ ]:
df1.show()

+---------+----+----------+------+
|     Name| age|Experience|Salary|
+---------+----+----------+------+
|    Krish|  31|        10| 30000|
|Sudhanshu|  30|         8| 25000|
|    Sunny|  29|         4| 20000|
|     Paul|  24|         3| 20000|
|   Harsha|  21|         1| 15000|
|  Shubham|  23|         2| 18000|
|   Mahesh|NULL|      NULL| 40000|
|     NULL|  34|        10| 38000|
|     NULL|  36|      NULL|  NULL|
+---------+----+----------+------+

In [ ]:
df1_ = df1.na.fill(0,['age','Experience','Salary'])

In [ ]:
df1_.show()

+---------+---+----------+------+
|     Name|age|Experience|Salary|
+---------+---+----------+------+
|    Krish| 31|        10| 30000|
|Sudhanshu| 30|         8| 25000|
|    Sunny| 29|         4| 20000|
|     Paul| 24|         3| 20000|
|   Harsha| 21|         1| 15000|
|  Shubham| 23|         2| 18000|
|   Mahesh|  0|         0| 40000|
|     NULL| 34|        10| 38000|
|     NULL| 36|         0|     0|
+---------+---+----------+------+

In [ ]:
df1.filter("Salary>=20000").show()

+---------+----+----------+------+
|     Name| age|Experience|Salary|
+---------+----+----------+------+
|    Krish|  31|        10| 30000|
|Sudhanshu|  30|         8| 25000|
|    Sunny|  29|         4| 20000|
|     Paul|  24|         3| 20000|
|   Mahesh|NULL|      NULL| 40000|
|     NULL|  34|        10| 38000|
+---------+----+----------+------+

In [ ]:
df1['Name',"Experience"].show()

+---------+----------+
|     Name|Experience|
+---------+----------+
|    Krish|        10|
|Sudhanshu|         8|
|    Sunny|         4|
|     Paul|         3|
|   Harsha|         1|
|  Shubham|         2|
|   Mahesh|      NULL|
|     NULL|        10|
|     NULL|      NULL|
+---------+----------+

In [ ]:
df1.filter("Salary>30000").select(["Name"]).show()

+------+
|  Name|
+------+
|Mahesh|
|  NULL|
+------+

In [ ]:
df3=df1.na.drop().show()

+---------+---+----------+------+
|     Name|age|Experience|Salary|
+---------+---+----------+------+
|    Krish| 31|        10| 30000|
|Sudhanshu| 30|         8| 25000|
|    Sunny| 29|         4| 20000|
|     Paul| 24|         3| 20000|
|   Harsha| 21|         1| 15000|
|  Shubham| 23|         2| 18000|
+---------+---+----------+------+

In [ ]:
df3 = spark.read.csv("test3.csv",inferSchema=True,header=True)

In [ ]:
df3.show()

+---------+------------+------+
|     Name| Departments|salary|
+---------+------------+------+
|    Krish|Data Science| 10000|
|    Krish|         IOT|  5000|
|   Mahesh|    Big Data|  4000|
|    Krish|    Big Data|  4000|
|   Mahesh|Data Science|  3000|
|Sudhanshu|Data Science| 20000|
|Sudhanshu|         IOT| 10000|
|Sudhanshu|    Big Data|  5000|
|    Sunny|Data Science| 10000|
|    Sunny|    Big Data|  2000|
+---------+------------+------+

In [ ]:
df3.groupBy("Departments").sum().show()

+------------+-----------+
| Departments|sum(salary)|
+------------+-----------+
|         IOT|      15000|
|    Big Data|      15000|
|Data Science|      43000|
+------------+-----------+

In [ ]:
df3.groupBy("Name").avg().show()

+---------+------------------+
|     Name|       avg(salary)|
+---------+------------------+
|Sudhanshu|11666.666666666666|
|    Sunny|            6000.0|
|    Krish| 6333.333333333333|
|   Mahesh|            3500.0|
+---------+------------------+

In [ ]:
df3.groupby("Departments").count().show()

+------------+-----+
| Departments|count|
+------------+-----+
|         IOT|    2|
|    Big Data|    4|
|Data Science|    4|
+------------+-----+

In [ ]:
df3.agg({"Departments":"count","Salary":"avg","Name":"count"}).show()

+-----------+------------------+-----------+
|avg(Salary)|count(Departments)|count(Name)|
+-----------+------------------+-----------+
|     7300.0|                10|         10|
+-----------+------------------+-----------+

In [ ]:
df3.createOrReplaceTempView("Employees")
spark.sql("SELECT AVG(Salary) from Employees  group by Departments").show()

+-----------+
|avg(Salary)|
+-----------+
|     7500.0|
|     3750.0|
|    10750.0|
+-----------+

In [ ]:
spark.sql("SELECT COUNT(*) FROM Employees Where Departments='IOT'").show()

+--------+
|count(1)|
+--------+
|       2|
+--------+

In [ ]:
spark.sql("SElect Name from Employees Where Departments='IOT'").show()

+---------+
|     Name|
+---------+
|    Krish|
|Sudhanshu|
+---------+